{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "spatial-chrome",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "cc3b151f-50b5-4090-889b-a7d60c28d584",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pprint\n",
    "pp = pprint.PrettyPrinter(indent=5)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "younger-affect",
   "metadata": {
    "tags": []
   },
   "source": [
    "You can also bypass TRAPI entirely and just use cypher to talk to the graph.  An intro to using the Cypher Query Language can be found here: https://neo4j.com/developer/cypher/guide-cypher-basics/\n",
    "\n",
    "There are two instances for accessing the graph using cypher.  There is one at http://robokopkg.renci.org which has a cypher browser on it, or you can write cypher and post it there.\n",
    "\n",
    "Additionally, cypher queries can be generated by clicking the `Copy` button from the ExEmPLAR tool after setting up a query pattern: https://www.exemplar.mml.unc.edu/\n",
    "\n",
    "The simplest example query below asks \"Find me a Gene that is related to both `PUBCHEM.COMPOUND:644073` (Buprenorphine) and `HP:0001337` (Tremor)\".\n",
    "\n",
    "We encountered issues with using the notation \"RETURN \\*\", mainly because this is not specific with what to return.  Queries to `automat` return edge properties, not including direction or predicates, but queries to `robokopkg.renci.org` return the direction and predicates, not including edge properties.  We replaced the \"\\*\" with a format to get node pairs and specific relationship information, including the type and properties."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "5570c171-b7f4-4dec-9f93-bd3571d5e010",
   "metadata": {},
   "outputs": [],
   "source": [
    "#cypher = f'MATCH (a:`biolink:Gene`) RETURN a LIMIT 1'\n",
    "#cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN * LIMIT 100\"\n",
    "#cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN a.id as identifier LIMIT 100\"\n",
    "\n",
    "# Simplified query for single entity nodes\n",
    "# cypher = \"MATCH (n0_0:`biolink:ChemicalEntity` {name:'Buprenorphine'})-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature` {name:'Tremor'}) RETURN * LIMIT 100\"\n",
    "\n",
    "# Buprenorphine -> [Gene] -> Tremor\n",
    "# cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN n0_0 as chemical_1, type(r0_0) as edge_1_type, r0_0 as edge_1  LIMIT 100\"\n",
    "# cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN n0_0 as chemical_1, r0_0 as edge_1, type(r0_0) as edge_1_type, properties(r0_0) as edge_1_properties  LIMIT 100\"\n",
    "# cyper = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN n0_0 as chemical_1, n1_0 as gene_1, n2_0 as phenotype_1, type(r0_0) as edge_1_type, r0_0 as edge_1, r1_0 as edge_2  LIMIT 100\"\n",
    "# cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN n0_0 as chemical_1, r0_0 as edge_1, type(r0_0) as edge_1_type, properties(r0_0) as edge_1_properties, [startNode(r0_0),endNode(r0_0)] as edge_1_node_pair LIMIT 100\"\n",
    "# cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN [startNode(r0_0),[type(r0_0),properties(r0_0)],endNode(r0_0)] as edge_1, [startNode(r1_0),[type(r1_0),properties(r1_0)],endNode(r1_0)] as edge_2 LIMIT 100\"\n",
    "cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN [startNode(r0_0),[type(r0_0),properties(r0_0)],endNode(r0_0)] as edge_1, [startNode(r1_0),[type(r1_0),properties(r1_0)],endNode(r1_0)] as edge_2, [n0_0.name, n1_0.name, n2_0.name] as node_names LIMIT 100\"\n",
    "\n",
    "# Asterixis\n",
    "# cypher = \"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Asterixis'] RETURN [startNode(r0_0),[type(r0_0),properties(r0_0)],endNode(r0_0)] as edge_1, [startNode(r1_0),[type(r1_0),properties(r1_0)],endNode(r1_0)] as edge_2 LIMIT 100\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3bcf9c74-9dc9-44bc-a56e-b0707c20639b",
   "metadata": {},
   "source": [
    "## Cypher - robokopkg.renci.org\n",
    "\n",
    "The first instance for accessing the graph using cypher is here using bolt.  After defining the Neo4jConnection class, the query is sent to http://robokopkg.renci.org"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "3e262083-238b-4e64-befb-7633d431ec59",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "f00dc13a-3b7f-4e7a-a394-6ce724536e93",
   "metadata": {},
   "outputs": [],
   "source": [
    "pw = ''\n",
    "conn = Neo4jConnection(uri=\"bolt://robokopkg.renci.org:7687\", user = 'neo4j', pwd = pw)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "b157e391-bb77-4eb5-bc10-ba6744bd5283",
   "metadata": {},
   "outputs": [],
   "source": [
    "record_list = conn.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13649715-a35a-40d5-8f30-73f9a72b14b6",
   "metadata": {},
   "source": [
    "Data in records are returned with columns labeled for nodes and relationships/edges.\n",
    "\n",
    "Node records contain all information about the object associated with a node, e.g. for Buprenorphine, contains label, SMILES, whether it's a receptor agonist or antagonist, etc. This is all in dictionary form.\n",
    "\n",
    "Edge records contain tuples of length 3.  The first and third items in the tuple are for the initial and terminal nodes, respectively.  These two items are the same as what appears in the node records.  The second item of the tuple is a string denoting the type of relationship, e.g. `biolink:affects`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "4b331306-cd9a-4548-80ee-4551d98f4f70",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "from pathlib import Path\n",
    "\n",
    "now = datetime.now()\n",
    "dt_string = now.strftime(\"%Y-%m-%d_%H%M%S\")\n",
    "write_dir = Path(\"output/Cypher_robokopkg\",str(dt_string))\n",
    "write_dir.mkdir(parents=True, exist_ok=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "615875dd-8939-4a30-98e6-953dbc2d7765",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Buprenorphine -> biolink:affects -> CYP2D6\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "CYP2D6 -> biolink:affects -> Buprenorphine\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "Buprenorphine -> biolink:regulates -> CYP2D6\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "Buprenorphine -> biolink:directly_physically_interacts_with -> CYP2D6\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "Buprenorphine -> biolink:affects -> CYP2D6\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "CYP2D6 -> biolink:affects -> Buprenorphine\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "Buprenorphine -> biolink:regulates -> CYP2D6\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n",
      "Buprenorphine -> biolink:directly_physically_interacts_with -> CYP2D6\n",
      "CYP2D6 -> biolink:genetic_association -> Tremor\n"
     ]
    }
   ],
   "source": [
    "i = 0\n",
    "\n",
    "for record in record_list: \n",
    "    record_data = record.data()\n",
    "    # pp.pprint(record_data)\n",
    "    # print(f'Result: {i+1}')\n",
    "    j = 0\n",
    "    record_data_first2 = {k: record_data[k] for k in list(record_data)[:2]}\n",
    "    for label, data in record_data_first2.items():\n",
    "        print(f\"{data[0]['name']} -> {data[1][0]} -> {data[2]['name']}\")||{data[1][1]}\")\n",
    "        string_out_test = f\"{data[0]['name']} -> {data[1][0]} -> {data[2]['name']}||{data[1][1]}\"\n",
    "        if string_out_test not in string_out_list:\n",
    "            string_out_list.append(string_out_test)\n",
    "        \n",
    "    i = i + 1\n",
    "    # if i > 0:\n",
    "    #     break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "3a6645df-df09-48fc-bee6-8d1c40a962ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Buprenorphine_CYP2D6_Tremor\n",
      "{    'Buprenorphine -> biolink:affects -> CYP2D6': 1,\n",
      "     'Buprenorphine -> biolink:directly_physically_interacts_with -> CYP2D6': 1,\n",
      "     'Buprenorphine -> biolink:regulates -> CYP2D6': 1,\n",
      "     'CYP2D6 -> biolink:affects -> Buprenorphine': 1,\n",
      "     'CYP2D6 -> biolink:genetic_association -> Tremor': 2}\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from collections import Counter\n",
    "\n",
    "i = 0\n",
    "\n",
    "string_out_list = []\n",
    "for record in record_list: \n",
    "    record_data = record.data()\n",
    "    # print(f'Result: {i+1}')\n",
    "    j = 0\n",
    "    # for label, data in record_data.items():\n",
    "    record_data_first2 = {k: record_data[k] for k in list(record_data)[:2]}\n",
    "    for label, data in record_data_first2.items():\n",
    "        string_out_test = f\"{data[0]['name']} -> {data[1][0]} -> {data[2]['name']}||{data[1][1]}\"\n",
    "        # print(f\"{data[0]['name']} -> {data[1][0]} -> {data[2]['name']}\")\n",
    "        # print(f\"Edge properties: {data[1][1]}\")\n",
    "        if string_out_test not in string_out_list:\n",
    "            string_out_list.append(string_out_test)\n",
    "        j = j + 1\n",
    "    # print(\"\")\n",
    "\n",
    "    i = i + 1\n",
    "    # if i > 0:\n",
    "        # break\n",
    "    \n",
    "combined_node_list = \"_\".join(results_json['results'][0]['data'][0]['row'][2]).replace(\" \", \"_\")\n",
    "print(combined_node_list)\n",
    "\n",
    "string_out_list = [i.split('||', 1)[0] for i in string_out_list]\n",
    "\n",
    "string_out_dict = dict(Counter(string_out_list).items())\n",
    "pp.pprint(string_out_dict)\n",
    "\n",
    "with open(os.path.join(write_dir,combined_node_list+\".txt\"), 'w') as convert_file:\n",
    "    convert_file.write(json.dumps(string_out_dict))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "collectible-burlington",
   "metadata": {},
   "source": [
    "## Cypher - automat.renci.org\n",
    "\n",
    "The second instance of accessing the graph using cypher is to send through the automat interface (https://automat.renci.org/robokopkg/cypher), using the same cypher query from above, submitted in a format compatible with json."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "dc91eb7b-5ea4-40c8-b7f7-727afcd234ae",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = f\"MATCH (n0_0:`biolink:ChemicalEntity`)-[r0_0]-(n1_0:`biolink:Gene`)-[r1_0]-(n2_0:`biolink:DiseaseOrPhenotypicFeature`) WHERE n0_0.name IN ['Buprenorphine'] AND n2_0.name IN ['Tremor'] RETURN [startNode(r0_0),[type(r0_0),properties(r0_0)],endNode(r0_0)] as edge_1, [startNode(r1_0),[type(r1_0),properties(r1_0)],endNode(r1_0)] as edge_2, [n0_0.name, n1_0.name, n2_0.name] as node_names LIMIT 100\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "fantastic-updating",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['edge_1', 'edge_2', 'node_names']\n",
      "200\n"
     ]
    }
   ],
   "source": [
    "j = {'query': cypher}\n",
    "results = requests.post('https://automat.renci.org/robokopkg/cypher',json=j)\n",
    "results_json = results.json()\n",
    "print(results_json['results'][0]['columns'])\n",
    "column_names = results_json['results'][0]['columns']\n",
    "print(results.status_code)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "b7eff2c6-cd4c-40b3-8baa-a189afd187f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "from pathlib import Path\n",
    "\n",
    "now = datetime.now()\n",
    "dt_string = now.strftime(\"%Y-%m-%d_%H%M%S\")\n",
    "write_dir = Path(\"output/Cypher_automat\",str(dt_string))\n",
    "write_dir.mkdir(parents=True, exist_ok=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "imposed-cross",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Buprenorphine_CYP2D6_Tremor\n",
      "{    'Buprenorphine -> biolink:affects -> CYP2D6': 1,\n",
      "     'Buprenorphine -> biolink:directly_physically_interacts_with -> CYP2D6': 1,\n",
      "     'CYP2D6 -> biolink:affects -> Buprenorphine': 1,\n",
      "     'CYP2D6 -> biolink:genetic_association -> Tremor': 2}\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from collections import Counter\n",
    "\n",
    "i = 0\n",
    "\n",
    "string_out_list = []\n",
    "for result in results_json['results'][0]['data']:\n",
    "    # print(f'Result: {i+1}')\n",
    "    j = 0\n",
    "    for item in result['row'][0:2]:\n",
    "        # print(item)\n",
    "        # print(f\"{column_names[j]}: {item[0]['name']} -> {item[1][0]} -> {item[2]['name']}\")\n",
    "        # print(f\"Edge properties: {item[1][1]}\\n\")\n",
    "        # print(f\"{item[0]['name']} -> {item[1][0]} -> {item[2]['name']}\")\n",
    "        # string_out = f\"{item[0]['name']} -> {item[1][0]} -> {item[2]['name']}\"\n",
    "        string_out_test = f\"{item[0]['name']} -> {item[1][0]} -> {item[2]['name']}||{item[1][1]}\"\n",
    "        if string_out_test not in string_out_list:\n",
    "            string_out_list.append(string_out_test)\n",
    "        j = j + 1\n",
    "    # print(\"\")\n",
    "\n",
    "    i = i + 1\n",
    "    # if i > 0:\n",
    "    #     break\n",
    "    \n",
    "combined_node_list = \"_\".join(results_json['results'][0]['data'][0]['row'][2]).replace(\" \", \"_\")\n",
    "print(combined_node_list)\n",
    "\n",
    "string_out_list = [i.split('||', 1)[0] for i in string_out_list]\n",
    "\n",
    "string_out_dict = dict(Counter(string_out_list).items())\n",
    "pp.pprint(string_out_dict)\n",
    "\n",
    "with open(os.path.join(write_dir,combined_node_list+\".txt\"), 'w') as convert_file:\n",
    "    convert_file.write(json.dumps(string_out_dict))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "81a0da69-3984-4e43-8469-cd75e37388b4",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
